<script setup lang='ts'>
import { useUserStore } from "@/store";
const userStore = useUserStore();
function tryOn(parentId:number,childId:number){
  let name = newsList[parentId].children[childId].name;
  // console.log(name,parentId,childId);
  userStore.updateUserInfo({
    tryText: name,
  });
}
const newsList = [
  {
    id: 0,
    name: "优化社交媒体策略以有效生成潜在客户",
    content:"社交媒体已成为企业产生潜在客户并与目标受众互动的强大工具。为潜在客户生成制定有效的社交媒体策略需要了解最适合您所在行业的平台，制作与您的受众产生共鸣的内容，并解决他们的痛点。以下高级提示将指导您创建针对特定行业和受众量身定制的全面社交媒体策略，从而最大限度地发挥您捕获和转换潜在客户的潜力。",
    children: [
      {
        id: 1,
        name: "在确定 [SaaS 行业]中最有效的潜在客户生成社交媒体平台时，我应考虑哪些因素？我如何创建一个内容策略，与[初创公司创始人]产生共鸣，让他们在更深层次上参与进来，并解决[他们对软件可扩展性和集成的担忧]？此外，建议优化内容的方法以提高可见性和参与度，最终推动更多潜在客户。",
      },
      {
        id: 2,
        name: "如何有效地利用[LinkedIn]为我的 [B2B 营销咨询服务]生成潜在客户？哪些类型的内容和活动最能成功推动此平台上的参与度和转化量？建议[关键绩效指标 （KPI）]，以监控和衡量我的 LinkedIn 营销活动在[下一季度]的成功，并为持续优化和改进提供建议。",
      }
    ],
  },
  {
    id: 1,
    name: "制作高转换铅磁铁",
    content:"铅磁铁是任何成功的潜在客户生成策略的重要组成部分。它们是您提供的有价值的内容或资源，以换取潜在客户的联系信息，帮助您建立电子邮件列表并将潜在客户培养成客户。要创建高转化率的铅磁铁，您需要了解目标受众的需求、偏好和痛点，并提供真正为他们的生活增加价值的解决方案。以下高级提示将指导您集思广益并创建针对您的特定受众和行业量身定制的引人入胜的铅磁铁，从而最大限度地提高捕获和转换潜在客户的机会。",
    children: [
      {
        id: 1,
        name: "您能否提出各种与[健身和营养]相关的铅磁铁创意，以引起[忙碌的专业人士]的共鸣，解决他们独特的痛点，帮助他们[实现更好的工作与生活平衡和更健康的生活方式]？考虑各种格式和内容类型，例如电子书、清单、模板、网络研讨会和测验，以吸引不同的偏好和学习风格。",
      },
      {
        id: 2,
        name: "我计划为对[数字营销]感兴趣的[小企业主]制作一个[视频系列]。你能帮我集思广益[10个]独特的想法，这些想法可以吸引他们的注意力，[解决共同的挑战]，并[鼓励他们注册免费咨询吗]？此外，提供有关推广和分发视频系列的最有效方法的见解，以最大限度地捕获潜在客户。",
      }
    ],
  },
  {
    id: 2,
    name: "产生创新的社交媒体帖子创意",
    content:"创建独特且引人入胜的社交媒体内容对于在拥挤的数字环境中脱颖而出至关重要。成功的关键在于产生创新的帖子创意，不仅能吸引观众的注意力，还能提供有价值的见解或可操作的提示。这些高级提示将帮助您集思广益，提出迎合特定角色或行业的帖子想法，并探索在各种社交媒体平台上实现特定目标的不常见策略。",
    children: [
      {
        id: 1,
        name: "像[科技初创公司]的[营销经理]一样行事。您能否推荐一系列社交媒体帖子，展示如何提高品牌在 [Instagram] 上的[知名度]，同时解决担任此职位的专业人士面临的独特挑战和机遇？",
      },
      {
        id: 2,
        name: "提供一系列不常见但有效的策略，[健身教练]可以使用这些策略来增加他们在 [TikTok] 上的关注者基础，同时考虑目标受众的特定需求、偏好和特征。",
      }
    ],
  },
  {
    id: 3,
    name: "掌握直播内容创作",
    content:"直播已成为在社交媒体平台上与观众互动的重要工具。无论您是经验丰富的主播还是刚刚起步，生成新鲜而令人兴奋的内容创意对于让您的观众保持娱乐和回来观看至关重要。以下提示旨在帮助您根据特定主题集思广益创意直播内容，并提供提升制作价值的提示。通过利用这些高级提示，您可以创建引人入胜的直播流，与观众产生共鸣并为频道的发展做出贡献。",
    children: [
      {
        id: 1,
        name: "您能否建议一系列针对可持续生活主题量身定制的独特且富有创意的直播内容创意？考虑各种形式，例如问答环节，幕后花絮，采访，合作，教程和互动活动，这些形式与主题一致并与目标受众产生共鸣。",
      },
      {
        id: 2,
        name: "有哪些可行的技巧和最佳实践可以提高[烹饪]直播的制作价值，使其看起来更专业、更精致？考虑照明、音频质量、相机设置、背景以及与观众的互动等因素，以改善整体流媒体体验。",
      }
    ],
  },
  {
    id: 4,
    name: "打造永恒且引人入胜的内容创意",
    content:"使用这些高级且适应性强的提示来提升您的内容创作游戏，这些提示专注于为您的目标受众生成常青且引人入胜的内容创意。无论您是创建视频、博客文章还是信息图表，这些提示都将指导您集思广益，提出展示您的产品或服务优势的创新概念。通过深入研究随着时间的推移保持相关性和趣味性的内容策略，这些提示将帮助您对受众产生持久的影响，并让他们再次光顾。准备好转变您的内容创建流程，并以引人入胜且发人深省的想法吸引观众。",
    children: [
      {
        id: 2,
        name: "为视频制定全面的内容创建计划，有效地传达可持续时尚品牌的好处，同时结合讲故事、数据可视化和用户生成内容的元素。探索各种内容格式、样式和演示技术，以确保您的信息保持吸引力、信息丰富且与目标受众相关。",
      },
      {
        id: 3,
        name: "确定制作常青博客文章的关键策略和原则，这些文章将与您的受众产生共鸣并随着时间的推移保持其相关性。研究如何将永恒的主题、普遍真理和实用建议融入您的内容中，同时忠于您的品牌标识和使命。评估内容重新调整用途、更新和受众互动在维持兴趣和延长内容保质期方面的作用。",
      },
    ],
  },
  {
    id: 5,
    name: "为客户制定全面的常见问题解答",
    content:"结构良好的常见问题解答部分可以通过提供快速解决方案并解决有关您的业务、网站、产品或服务的常见问题来显着改善您网站的用户体验。在此高级提示集合中，我们旨在帮助您创建全面的常见问题解答，不仅可以回答常见问题，还可以解决误解并提供准确的信息。通过遵循提供的示例并考虑共享的提示，您将有能力为您的客户开发信息丰富且易于访问的常见问题解答部分。",
    children: [
      {
        id: 1,
        name: "我想通过为我们的在线商店开发常见问题解答部分来增强我的电子商务网站上的用户体验。您能否帮助我编制一份有关订单处理、运输、退货和付款方式的常见问题和相应答案列表，以便为我的客户提供即时帮助和解决方案？",
      },
      {
        id: 2,
        name: "我想创建一个常见问题解答部分，专门解决关于我们代餐产品营养价值的常见误解。您能帮我写出提供准确信息、消除任何混淆并基于我们产品文档中提供的科学研究的答案吗？",
      },
    ],
  },
  {
    id: 6,
    name: "精心打造引人入胜的故事角度，实现最大影响力",
    content:"开发引人入胜的故事角度对于吸引观众的注意力并将您的内容与竞争对手区分开来至关重要。精心设计的故事角度不仅会引起兴趣，还可以确保您的内容与目标受众产生共鸣，并为他们提供有价值的见解。以下高级提示将指导您创建引人入胜的故事角度，探索给定主题的各个维度，结合研究或数据，并考虑对特定受众或社区的影响。",
    children: [
      {
        id: 1,
        name: "在关于[零工经济]的故事中，考虑到[自由职业者和独立承包商]的观点，并研究它与[未来工作]的联系，有哪些引人入胜的角度可以探索？此外，考虑最有效的叙事结构和讲故事技巧，以有影响力和令人难忘的方式传达故事。",
      },
      {
        id: 2,
        name: "您能否为我关于[气候变化对沿海社区影响]的文章提出一些独特的故事角度，这些角度结合[最新的研究和数据]，研究对[小岛屿国家]的影响，并以令人信服和易于理解的方式呈现这些发现？此外，确定与所选角度相关的任何潜在挑战或限制，并提出解决这些挑战或限制的策略。",
      },
    ],
  },
  {
    id: 7,
    name: "制作独特而富有洞察力的公司博客内容",
    content:"为您的公司博客开发引人入胜且信息丰富的内容对于建立品牌声誉和与目标受众建立联系至关重要。要创建独特而有见地的博客文章，重要的是要探索有关相关主题的新观点，与行业趋势保持同步，并结合数据驱动的见解。以下高级提示将指导您集思广益，发现子主题，发现趋势并确定有价值的研究或统计数据，以提高公司博客内容的质量。",
    children: [
      {
        id: 1,
        name: "我们希望在我们的公司博客上写关于可持续时尚的文章，但我们希望采取一个独特的角度，将我们的内容与竞争对手区分开来。您能否建议一些与可持续时尚相关的创新子主题，我们可以在我们的博客文章中探讨，考虑时尚行业的新兴趋势和代表性不足的观点？",
      },
      {
        id: 2,
        name: "我们希望及时了解最新的人工智能趋势和见解，但我们不确定从哪里开始。您能否提供一些关于人工智能的前沿统计数据和研究，我们可以将其用于我们的下一篇公司博客文章，重点关注人工智能行业的最新发展和创新？此外，建议一些信誉良好的来源进行正在进行的研究和趋势分析。",
      },
    ],
  },
  {
    id: 8,
    name: "开发引人注目的客座博客文章宣传以获得最大影响",
    content:"制作突出并引起注意的客座博客文章宣传需要深入了解目标博客的受众、风格和语气，以及就您选择的主题呈现独特且引人入胜的角度的能力。以下高级提示将指导您集思广益和构建客座博客文章，这些文章不仅符合目标博客的编辑指南，而且还能引起读者的共鸣，帮助您建立个人品牌并在您的利基市场中建立思想领导力。",
    children: [
      {
        id: 1,
        name: "您能否帮助我确定几个独特的角度，为“Tech Today”撰写一篇关于客户服务中人工智能的客座博客文章，特别关注小型企业，并解决为优先考虑客户体验并对创新解决方案感兴趣的精通技术的企业家的目标受众实施人工智能解决方案的挑战？此外，请提供有关如何定制内容以匹配“Tech Today”的风格和语气的见解，同时仍然展示我独特的声音和专业知识。",
      },
      {
        id: 2,
        name: "您能否帮我为一篇关于远程团队管理的客座博客文章创建一个详细的大纲，该文章与“在家工作周刊”的风格和语气保持一致，特别是包括沟通和协作的最佳实践和保持工作与生活平衡的技巧，以及解决管理分布式团队的挑战对于首次担任远程经理并希望在培养积极的远程工作文化的同时确保生产力的目标受众成员？此外，建议策略，使我的内容对读者更具吸引力、信息量和可操作性。",
      },
    ],
  },
  {
    id: 9,
    name: "制定产品植入机会战略，实现最大影响",
    content:"当以微妙和创造性完成时，产品植入可能是一种有效的营销策略，确保它为您的项目增加价值并增强整体叙事，而不是感到被迫或侵入。以下高级提示将帮助您集思广益并开发符合项目主题、流派和基调的产品植入机会，同时有效地展示特色产品并与目标受众产生共鸣。",
    children: [
      {
        id: 1,
        name: "考虑到我项目的浪漫喜剧主题，您能否提供一份餐厅或外卖品牌列表，这些品牌非常适合以主要角色为特色的约会夜景？此外，建议将这些品牌融入场景的创造性方法，确保它们与故事的叙事和氛围相得益彰，同时突出其独特的功能、优势或关联。",
      },
      {
        id: 2,
        name: "我怎样才能创造性地无缝地将高端跑车品牌整合到一个动感十足的追逐场景中，展示主角的足智多谋，同时保持我的项目的惊心动魄和紧张的基调，避免对叙事流程的任何干扰？考虑不同的方法，例如视觉提示、对话或角色动作，这些方法可以有效地突出产品，而不会感到被迫或不合适。",
      },
    ],
  },
  {
    id: 10,
    name: "编程高手",
    children: [
      {
        id: 1,
        name: "用python写一段hello world示例，回答请尽量言简意赅，不要有过多解释",
      },
      {
        id: 2,
        name: "你现在是一个 Regex 专家，请帮我写一个 Regex ，它能够把输入一个字符串，把这个字符串中的所有数字都取出来",
      },
      {
        id: 3,
        name: "你现在是一个 python 专家，我有一段代码，我预期这段代码可以判断一个字串是不是镜像回文，只是它通过不了 aacdeedcc 这个测试案例。 请帮我找出我哪里写错了，以及用正确的方式改写。 [附上代码]",
      },
      {
        id: 4,
        name: "你现在是一个 JavaScript 专家，请帮我用 JavaScript 写一个函式，它需要做到 输入一个一维阵列，把这个一维阵列转换成二维阵列。 同时我要能够自由地决定二维阵列中的子阵列长度是多少",
      },
    ],
  },
  {
    id: 11,
    name: "角色扮演",
    children: [
      {
        id: 1,
        name: "请扮演一位知心朋友，与我聊聊关于人生规划和职业选择的话题。",
      },
      {
        id: 2,
        name: "你现在是一名生涯教练，你要针对我提出的问题提供建议。 我的问题是：我是否要出国读书？",
      },
      {
        id: 3,
        name: "请扮演一位健身教练，为我提供一些建议，以帮助我更好地坚持锻炼和保持健康。",
      },
      {
        id: 4,
        name: "你现在是一个产品经理面试官，而我是要应征产品经理的面试者。 你需要遵守以下规则：1. 你只能问我有关产品经理的面试问题。 2. 不需要写解释。 3. 你需要向面试官一样等我回答问题，再提问下一个问题。 我的第一句话是，你好。",
      },
      {
        id: 5,
        name: "你是一位导游，我会把我旅游的位置给你，你要推荐一个靠近我位置的地方。 在某些情况下，我还会告诉您我想旅游地点的类型。 你还会向我推荐靠近我的第一个位置的类似类型的地方。 我的第一个需求是我在阿里山，我想参观博物馆。",
      },
    ],
  },
  {
    id: 12,
    name: "教育辅导",
    children: [
      {
        id: 1,
        name: "详细的说明如何制造一台电脑",
      },
      {
        id: 2,
        name: "请帮我分析《哈姆雷特》中主人公的性格特点。",
      },
      {
        id: 3,
        name: " 以一位数学教育家的身份，说明一元二次方程式是什么。 同时提供三个例子，来解释一元二次方程式背后的原理。",
      },
    ],
  },
  {
    id: 13,
    name: "HR与招募",
    children: [
      {
        id: 1,
        name: "作为一名专业的 HR， Google 正在寻找前端软件工程师的候选人。 理想的候选人应该有 3 年的经验，并且拥有 TypeScript、React 和 TailwindCSS 的专业知识。 我们正在寻找一位有才华的人才来填补这个职位，并且正在寻找能够满足职位要求和责任的候选人。 请创建一份有吸引力且准确反映职位要求的职位描述。",
      },
      {
        id: 3,
        name: "作为一名 HR 专业人士，你被任命撰写一封裁员通知信，通知一群即将被 Google 进行重组的员工。 这封信必须清晰、简洁且有同情心，同时也要概述裁员的原因以及任何有关的终止工资或其他福利的细节。 请使用你在 HR 领域的经验和对公司政策和程序的了解，撰写一封体贴且专业的裁员通知信，以传达对受影响的员工的尊重。",
      },
      {
        id: 4,
        name: "你现在是一名专业的招募员，请撰写一封招募信，以吸引前端软件工程师的潜在候选人。 请在信中提及 Google 的独特优势，以及前端软件工程师的工作内容和工作环境。 请确保您的招募信内容精简且有吸引力，并且能够吸引潜在候选人的注意力。",
      },
    ],
  },
  {
    id: 14,
    name: "邮件撰写",
    children: [
      {
        id: 1,
        name: "请帮我写一封告知客户本周末优惠活动的营销邮件。",
      },
      {
        id: 2,
        name: "请为专注于心理健康提示的时事通讯创建一个引人入胜的主题行，专门针对在职专业人士，目的是提高读者的参与度。请确保主题行体现支持性和信息性的语气，并整合以下关键字/短语：“压力管理”，“工作与生活平衡”。",
      },
      {
        id: 3,
        name: "请撰写一封关于公司年度总结的内部通知邮件。",
      },
      {
        id: 4,
        name: "请生成一个引人注目的电子邮件主题行，用于推广专为年轻专业人士量身定制的新健身应用程序，目的是吸引应用程序下载量。确保主题行采用激励语气并包含以下关键字/短语：“转变您的锻炼”、“提高工作效率”",
      },
      {
        id: 5,
        name: "你是一名产品经理，我会给你一封电子邮件，你要回复这封电子邮件。 电子邮件：[附上内容]",
      },
      
    ],
  },
  {
    id: 14,
    name: "趣味生活",
    children: [
      {
        id: 1,
        name: "我今天在图书馆看到一个女生很心动，很想认识她，第一句话怎么开口呢。多提供几条建议",
      },
      {
        id: 2,
        name: "写出5个有关日本迪士尼旅游心得的Instagram风格标题，要遵守以下规则：标题不超过20字、标题要加上适当表情符号。",
      },
      {
        id: 3,
        name: "你是现在最红的饶舌歌手，请创作一首 Rap，主题是孤勇者。",
      },
      {
        id: 4,
        name: "提供5个情人节的点子",
      },
    ],
  },
  {
    id: 15,
    name: "博客文章与新闻稿",
    children: [
      {
        id: 1,
        name: "请为我撰写一篇关于虚拟现实技术在教育领域应用的博客文章",
      },
      {
        id: 2,
        name: "请根据我们新产品发布会的信息，编写一篇新闻稿",
      },
      {
        id: 3,
        name: "请帮我写一篇关于企业社会责任的博客文章，包括公司的实际做法和成果。",
      },
    ],
  },
  {
    id: 15,
    name: "创意写作",
    children: [
      {
        id: 1,
        name: "请根据以下情节梗概，为我编写一个短篇科幻小说：在未来的地球上，人类与机器人共存，但一场突如其来的危机改变了这一切。",
      },
      {
        id: 2,
        name: "请扮演编辑人员，提供反馈以改善以下文章的文法。 请识别和更正任何错误，同时提出改善写作风格的建议。 请务必对您的建议和更正提供清晰的解释。 文章为[附上文章]。",
      },
      {
        id: 3,
        name: "你现在是一名专业的内容写手，草拟一篇网络游戏相关的信息性文章。 文章应在500字以内，包括网络游戏的重要性、各种类型及其优点。 请务必引用相关统计数据、例子和来源支持你的观点。",
      },
    ],
  },
  {
    id: 16,
    name: "技术文档",
    children: [
      {
        id: 1,
        name: "请为我们的新款智能手表撰写一份产品说明书，包括功能、使用方法和注意事项。",
      },
      {
        id: 2,
        name: "请根据我们的软件产品特点，编写一份操作手册。",
      },
      {
        id: 3,
        name: "请帮我创建一份关于我们电子产品维修流程的FAQ文档。",
      },
    ],
  },
  {
    id: 16,
    name: "会议记录与总结",
    children: [
      {
        id: 1,
        name: "请根据我提供的以下会议摘要，为我生成一份详细的会议记录。",
      },
      {
        id: 2,
        name: "请帮我总结刚刚进行的项目进度汇报会议，包括关键事项和后续行动计划。",
      },
      {
        id: 3,
        name: "请根据以下简要说明，为我撰写一份关于新员工培训会议的总结报告。",
      },
    ],
  },
  {
    id: 17,
    name: "商业计划与战略",
    children: [
      {
        id: 1,
        name: "请帮助我制定一份针对新成立的餐饮企业的商业计划，包括市场分析、目标客户群、竞争对手分析、营销策略以及财务预测。",
      },
      {
        id: 2,
        name: "请为一家互联网初创公司设计一个产品推广战略，包括定位、目标市场、渠道选择以及预期收益。",
      },
      {
        id: 3,
        name: "请分析如何在竞争激烈的电商领域中，提升一家中小型企业的市场份额和品牌知名度。",
      },
    ],
  },
  {
    id: 18,
    name: "数据分析报告",
    children: [
      {
        id: 1,
        name: "请根据给定的销售数据，分析一家零售公司近一年的销售趋势，并提出改善销售业绩的建议。",
      },
      {
        id: 2,
        name: "请根据提供的社交媒体数据，分析一家公司的社交媒体活动效果，包括关注者增长、互动率以及内容传播情况，并给出优化策略。",
      },
      {
        id: 3,
        name: "请分析一家企业的客户满意度调查数据，找出影响客户满意度的关键因素，并提出提高客户满意度的方案。",
      },
    ],
  },
  {
    id: 19,
    name: "中国传统文化",
    children: [
      {
        id: 1,
        name: "请介绍中国的传统节日中秋节的由来和习俗。",
      },
      {
        id: 2,
        name: "请分析《红楼梦》在中国古典文学中的地位和影响。",
      },
      {
        id: 3,
        name: "请谈谈中国传统建筑的特点和代表性建筑物。",
      },
    ],
  },
  {
    id: 20,
    name: "个人健康与健身",
    children: [
      {
        id: 1,
        name: "请给我推荐一个适合初学者的瑜伽动作。",
      },
      {
        id: 2,
        name: "请介绍一下高血压患者应该注意的饮食原则。",
      },
      {
        id: 3,
        name: "请分享一个增肌训练计划。",
      },
    ],
  },
  {
    id: 21,
    name: "生活建议与心理辅导",
    children: [
      {
        id: 1,
        name: "请给我提供一些建议，如何应对恋爱中的沟通问题？",
      },
      {
        id: 2,
        name: "请分享一些提高自信心的方法。",
      },
      {
        id: 3,
        name: "请教我如何缓解焦虑和压力？",
      },
    ],
  },
  {
    id: 22,
    name: "旅行规划与攻略",
    children: [
      {
        id: 1,
        name: "请为我规划一条10天的欧洲旅行线路。",
      },
      {
        id: 2,
        name: "生成一份5天的东京旅游计划，交通工具是地铁和火车。 要遵守以下规则：1. 地点要包含东京铁塔、富士山、迪士尼乐园 2. 需要包含交通如何乘坐 3. 一天不超过3个地点。",
      },
      {
        id: 3,
        name: "请分享一些在泰国曼谷旅行时的实用贴士。",
      },
    ],
  },
  {
    id: 23,
    name: "投资与理财建议",
    children: [
      {
        id: 1,
        name: "作为一名个人投资者，你需要创建一个与你的风险承受能力和财务目标相符的多元化投资组合。 开发一个资产配置策略，包括股票、债券和其他证券的组合。",
      },
      {
        id: 2,
        name: "作为一名个人投资者，你需要开发一个交易策略，包括技术和基本分析。 创建一组交易规则，包括进入点和退出点、停损订单和风险管理技术。",
      },
      {
        id: 3,
        name: "作為一名加密貨幣投資者，你需要開發一個加密貨幣投資策略，包括技術和基本分析。請針對加密貨幣的特性，創建一組交易規則，包括進入點和退出點、停損訂單和風險管理技術。",
      },
    ],
  },
  {
    id: 24,
    name: "美食与烹饪",
    children: [
      {
        id: 1,
        name: "请列出这份食谱的采买清单和步骤：1 人份的蕃茄炒蛋。",
      },
      {
        id: 2,
        name: "提供给我一个食谱，食材包含鸡腿肉、鸡蛋、起司。",
      },
      {
        id: 3,
        name: "请分享一些烹饪技巧，以提高菜肴的口感和营养价值。",
      },
    ],
  },
  {
    id: 25,
    name: "科技与数码产品",
    children: [
      {
        id: 1,
        name: "请比较一下苹果iPhone和三星Galaxy系列手机的特点和优势。",
      },
      {
        id: 2,
        name: "请为我推荐一款性价比高的笔记本电脑。",
      },
      {
        id: 3,
        name: "请介绍一下家用无线路由器的购买和配置注意事项。",
      },
    ],
  },
  {
    id: 26,
    name: "英语学习",
    children: [
      {
        id: 1,
        name: "用中文解释以下英文单词：apple， orange， doctor， car， run。 请用表格的方式呈现，并且表格内须包含单字、词性、解释与例句。",
      },
      {
        id: 2,
        name: "现在你是一位专业的英语老师。 请提供几个可以帮助学习的资源和工具列表，例如语言交换网站、播客和手机应用程序。",
      },
      {
        id: 3,
        name: "现在你是一位英语教师。 提供学习英语的技巧和诀窍。 包括提高词汇、语法和发音的学习方法。",
      },
    ],
  },
  {
    id: 27,
    name: "游戏娱乐",
    children: [
      {
        id: 1,
        name: "我们来玩猜谜语吧，你说谜面，我猜谜底",
      },
      {
        id: 2,
        name: "给我讲个有意思的笑话吧，笑点要足",
      },
      {
        id: 3,
        name: "请为我提供一个关于动物的谜语，要求具有趣味性和启发性。",
      },
    ],
  },
  {
    id: 28,
    name: "制定有效的预算策略",
    content:"预算在管理个人财务和实现财务目标方面起着至关重要的作用。制定有效的预算策略可以帮助个人保持对支出的控制、节省资金并为未来需求制定计划。在这种情况下，以下提示将帮助用户了解预算的重要性，探索各种预算技术，并确定优化其财务管理的最佳实践。",
    children: [
      {
        id: 1,
        name: "讨论预算对年轻人的重要性，以及实施精心策划的预算如何帮助他们实现财务目标。考虑收入、支出、储蓄和财务目标等因素。",
      },
      {
        id: 2,
        name: "比较对比不同的预算编制方法，如50/30/20规则、零基预算制、信封制等，突出其优缺点。解释哪种方法可能最适合收入可变的家庭以及原因。",
      },
    ],
  },
  {
    id: 29,
    name: "掌握抖音的增长和参与度",
    content:"通过这些高级提示促进 TikTok 频道的增长，旨在帮助您制作引人入胜的字幕，与您的观众产生共鸣并展示您的独特内容。无论您是在推广新产品还是制作有趣的短剧，引人入胜的字幕对于激发兴趣、最大化观看次数和增加关注者数量都至关重要。通过利用创造力、幽默和讲故事的力量来增强您的 TikTok 内容策略，以与您的受众建立联系并留下持久的印象。",
    children: [
      {
        id: 1,
        name: "为 TikTok 视频制作引人入胜且引人注目的字幕，介绍您的新环保水瓶，强调其独特的卖点、优势和功能。使用简洁的语言、表情符号和相关主题标签来创建与您的目标受众产生共鸣的标题，并鼓励他们与您的内容互动并进一步探索您的产品。",
      },
      {
        id: 2,
        name: "为 TikTok 视频写一个不可抗拒的朗朗上口和幽默的标题，其中 Jane Doe 表演了一个关于尴尬的 Zoom 会议的喜剧短剧。捕捉短剧的精髓，结合热门主题标签或挑战，并使用俏皮的语言来吸引观众观看、分享和参与您的内容。考虑添加号召性用语，鼓励观看者关注您的帐号，获取更有趣的内容。",
      },
    ],
  },
  {
    id: 30,
    name: "打造创新的Pinterest创意",
    content:"通过这些创意提示提升您的 Pinterest 游戏，这些提示旨在帮助您生成针对特定季节、节假日或受众细分量身定制的独特且引人入胜的图板创意。通过专注于创建与目标受众产生共鸣并展示您品牌独特视角的看板，您将能够吸引您的 Pinterest 关注者并激励他们保存、分享和参与您的内容。准备好通过精心打造创新和引人注目的董事会创意，释放 Pinterest 作为强大营销和内容管理平台的全部潜力。",
    children: [
      {
        id: 1,
        name: "制定一个全面的 Pinterest 看板创意列表，通过展示鼓舞人心的相关内容（例如 DIY 项目、食谱、时尚趋势和家居装饰创意）来庆祝冬季。考虑结合主题元素、配色方案和关键字，创建一个有凝聚力和视觉吸引力的板，捕捉冬季的精神和本质。",
      },
      {
        id: 2,
        name: "根据教师的需求和兴趣量身定制的头脑风暴 Pinterest 板想法，重点关注为该群体面临的共同挑战提供价值、灵感和解决方案的主题。探索各种主题，例如教育资源、生产力技巧、自我保健技巧和社区建设计划，以创建一个多功能且引人入胜的看板，以满足目标受众的独特偏好。",
      },
    ],
  },
  {
    id: 31,
    name: "制作有影响力和洞察力的播客",
    content:"通过这一系列先进的、可自定义的提示来提升您的播客游戏，这些提示旨在帮助您创建引人入胜且富有洞察力的播客剧集，从而引起观众的共鸣。这些提示深入研究了各种主题、它们的好处以及它们对特定群体、行业或领域的影响。通过使用这些提示，您可以为听众提供发人深省的内容、真实世界的示例、专家预测和深入分析。准备好创建引人入胜的播客剧集，让您的观众渴望更多。",
    children: [
      {
        id: 1,
        name: "分析自由职业者远程工作的好处、挑战和演变。调查它过去如何对个人或团体产生积极影响，并讨论随着时间的推移为提高其有效性而取得的进展。此外，探索与远程工作相关的任何潜在缺点或限制，并提出可能的解决方案或调整来解决这些问题。",
      },
      {
        id: 2,
        name: "通过讨论历史影响、其影响的真实示例以及随时间发生的任何变化，研究人工智能对医疗保健行业的多方面影响。此外，深入研究专家对与医疗保健行业相关的人工智能未来的预测，并探索可能在未来几年塑造人工智能方向的潜在机遇、挑战或新兴趋势",
      },
    ],
  },
  {
    id: 32,
    name: "营销策略",
    children: [
      {
        id: 1,
        name: "分析自由职业者远程工作的好处、挑战和演变。调查它过去如何对个作为一个 B2B 科技公司的数字营销人员，创建一个 Email 营销活动，以推广企业版 Office 365。 利用你对高阶管理人员的了解，撰写一系列引人入胜的 Email，突出产品的独特特点和优势。 透过引人入胜的主题行和明确的呼吁行动，最大化开启率和转换率。人或团体产生积极影响，并讨论随着时间的推移为提高其有效性而取得的进展。此外，探索与远程工作相关的任何潜在缺点或限制，并提出可能的解决方案或调整来解决这些问题。",
      },
      {
        id: 2,
        name: "作为微软的社交媒体经理，创建一个社交媒体营销活动，以宣传企业版 Office 365。 设计一个具有创意和吸引力的在线活动，通过多样化的社交媒体贴文和付费广告，来推进营销计划。 同时设定明确的目标和衡量指标，以确保营销方案有达到预期的成果。",
      },
      {
        id: 3,
        name: "作为一位 B2B 科技公司的营销经理，你需要为即将到来的一年，创建一个全面的营销策略计划。 这个计划需要包括目标受众分析、营销渠道、预算分配和用于追踪成功的指标。",
      },
    ],
  },
  {
    id: 33,
    name: "准备面试",
    children: [
      {
        id: 1,
        name: "你现在是 Google 的产品经理面试官，请分享在 Google 产品经理面试时最常会问的 5 个问题。",
      },
      {
        id: 2,
        name: "针对「你会如何排定不同产品功能优先级？」 这个面试问题，请提供一些常见的追问面试题。",
      },
      {
        id: 3,
        name: "我针对「你会如何排定不同产品功能优先级？」 的回答，有哪些可以改进的地方？ [附上回答]",
      },
      {
        id: 4,
        name: "我在准备「请分享一个你在急迫的期限中完成项目的经验」这个面试问题，请用 STAR 原则帮我回答这个问题。 针对这个问题，我有的经历如下 [附上经历]。",
      },
      {
        id: 5,
        name: "我在准备「请分享一个你在急迫的期限中完成项目的经验」这个面试问题，请用 STAR 原则帮我回答这个问题。 针对这个问题，我有的经历如下 [附上经历]。",
      },
    ],
  },
];
</script>

<template>
  <div class="p-6">
    <div class="text-center text-2xl font-semibold mb-10">
      <span
        class="cursor-pointer transition duration-300 ease-in-out text-blue-600"
        >ChatGPT 指令大全</span
      >
      <span class="mx-6 text-gray-300">|</span>
      <!-- <span class="cursor-pointer transition duration-300 ease-in-out text-gray-400">注意事项</span> -->
      <span class="cursor-pointer transition duration-300 ease-in-out text-gray-400">Daller2 指南</span>
    </div>
    <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-8" style="font-family: cursive">
      <div
        class="bg-gradient-to-br p-6 rounded-lg shadow-lg" v-for="(item, index) of newsList" :key="index" >
        <h3 class="text-xl font-semibold mb-4">{{ item.name }}</h3>
        <h3 class="text-xs mb-4">{{ item.content }}</h3>
        <ul class="list-disc list-inside">
          <li class="text-base mb-3 flex items-center" v-for="(child, index2) of item.children" :key="index2">
            <div class="flex-grow mr-2">
              <span>{{ child.name }}</span>
            </div>
            <button @click="tryOn(index,index2)" class="bg-white text-blue-500 dark:text-indigo-400 hover:bg-blue-200 dark:hover:bg-indigo-300 px-3 py-1 rounded whitespace-nowrap transition duration-300 ease-in-out">
              尝试
            </button>
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>